In [1]:
import mysql.connector as conn
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
myconn = conn.connect(host="localhost",user="root",passwd="root1234")

In [3]:
myconn

In [4]:
cursor = myconn.cursor()

In [5]:
cursor

In [6]:
result = cursor.execute("show databases")
cursor.fetchall()

[('assignment',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('student_result',),
 ('sys',),
 ('world',)]

In [7]:
query = "use student_result"
cursor.execute(query)

In [8]:
#query = "CREATE TABLE student_marks (roll_no int primary key, first_name varchar(30),last_name varchar(30),subject1 int,subject2 int ,subject3 int,subject4 int,sum_of_marks int,percentage int)"

In [9]:
cursor.execute(query)

In [10]:
result = cursor.execute("show tables")
cursor.fetchall()

[('student_marks',)]

In [23]:
total_marks = 400
passing_marks_per_subject = 35

roll_no = int(input("Enter roll_no"))
first_name = input("Enter first name")
last_name = input("Enter last name")
subject1 = int(input("Enter marks of subject 1: "))
subject2 = int(input("Enter marks of subject 2: "))
subject3 = int(input("Enter marks of subject 3: "))
subject4 = int(input("Enter marks of subject 4: "))

sum_of_marks = subject1+subject2+subject3+subject4
print(sum_of_marks)
percentage = (sum_of_marks/total_marks)*100
print(percentage)

Enter roll_no10
Enter first nameDraco
Enter last nameMalfoy
Enter marks of subject 1: 55
Enter marks of subject 2: 66
Enter marks of subject 3: 77
Enter marks of subject 4: 88
286
71.5

In [24]:
cursor.execute(" insert into student_marks(roll_no,first_name,last_name,subject1,subject2,subject3,subject4,sum_of_marks,percentage) values(%s,%s,%s,%s,%s,%s,%s,%s,%s)",(roll_no,first_name,last_name,subject1,subject2,subject3,subject4,sum_of_marks,percentage))

In [25]:
query ="""
select * 
from student_marks
"""
data = pd.read_sql_query(query,myconn)
data

,roll_no,first_name,last_name,subject1,subject2,subject3,subject4,sum_of_marks,percentage
0,1,Harry,Potter,66,66,66,66,264,66
1,2,Ron,Weasley,77,66,44,77,264,66
2,3,Hermione,Granger,99,99,99,99,396,99
3,4,Dean,Thomas,77,77,66,77,297,74
4,5,neville,longbottom,44,44,66,44,198,50
5,6,alicia,schmidt,32,55,66,44,197,49
6,7,parvati,patil,88,66,55,22,231,58
7,8,percy,weasley,22,55,66,44,187,47
8,9,filch,nanw,22,33,11,22,88,22
9,10,Draco,Malfoy,55,66,77,88,286,72

In [26]:
myconn.commit()